Tekla.Structures.Dialog.UIControls.CreateDialog
The CreateDialog class represents a "template" dialog for creating something from parts.

Tekla.Structures.Dialog.UIControls.CreateDialog.#ctor
Initializes a new instance of the CreateDialog class.

Tekla.Structures.Dialog.UIControls.CreateDialog.OnLoad(System.EventArgs)
The create dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.CreateDialog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.CreateDialog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.CreateDialog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.

Tekla.Structures.Dialog.UIControls.CreateDialog.createLabel
The createLabel: what is going to be created (to be changed by the user).

Tekla.Structures.Dialog.UIControls.CreateDialog.allPartsRadioButton
The allPartsRadioButton creates from all parts.

Tekla.Structures.Dialog.UIControls.CreateDialog.selectedPartsRadioButton
The selectedPartsRadioButton creates from selected parts.

Tekla.Structures.Dialog.UIControls.CreateDialog.settingsLabel
The settingsLabel: settings related to the creation command (to be changed by the user).

Tekla.Structures.Dialog.UIControls.CreateDialog.suboptionsButton
The suboptionsButton opens the dialog for suboptions.

Tekla.Structures.Dialog.UIControls.CreateDialog.instructionsLabel
The instructionsLabel: brief instructions on how to use the dialog (to be changed by the user).

Tekla.Structures.Dialog.UIControls.CreateDialog.cancelButton
The cancelButton cancels the creation.

Tekla.Structures.Dialog.UIControls.CreateDialog.createButton
The createButton creates the items.